html/twitter-bootstrap-step-by-step.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2013-05-13 Mon 17:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. <code>[0/9]</code> Build an initial Rails application</a></li>
<li><a href="#sec-3">3. <code>[0/4]</code> Incorporate Twitter Bootstrap's CSS style sheets and JavaScript scripts.</a></li>
<li><a href="#sec-4">4. <code>[0/2]</code> Use Twitter Bootstrap fixed width layout in our Rails application</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a step by step tutorial for new Rails learners to learn how
Twitter Bootstrap works and to how to use Twitter Bootstrap to provide
your application with modern layout and styling. We will build a working
Rails application to match the <a href="http://twitter.github.io/bootstrap/examples/starter-template.html">starter-template.html</a> template from
<a href="http://twitter.github.io/bootstrap/getting-started.html#examples">getting-started.html#examples</a>.
</p>

<p>
You can follow the steps below to create a working Rails application.
</p>

<p>
Note for Emacs users: This tutorial was written in Emacs Org Mode. If
you are an Emacs Org Mode user you can carry out the steps in this tutorial
from the twitter-bootstrap-step-by-step.org file.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <code>[0/9]</code> Build an initial Rails application</h2>
<div class="outline-text-2" id="text-2">
<p>
The <a href="http://twitter.github.io/bootstrap/index.html">Twitter Bootstrap project</a> website provides <a href="http://twitter.github.io/bootstrap/getting-started.html#examples">8 example layouts</a>. In this tutorial we
will use the <a href="http://twitter.github.io/bootstrap/examples/starter-template.html">starter-template.html</a> template to see how to use Bootstrap's CSS layout.
</p>

<p>
See <a href="http://twitter.github.io/bootstrap/"><a href="http://twitter.github.io/bootstrap/">http://twitter.github.io/bootstrap/</a></a> -&gt; <a href="http://twitter.github.io/bootstrap/getting-started.html#examples">getting-started.html#examples</a> to view all 8 examples.
See <a href="https://github.com/twitter/bootstrap">Bootstrap GitHub Repository</a> to view the developement repository.
</p>

<p>
Let's build our example Rails application with a 'home' controller
and 'home/index', "home/about", "home/contact" pages since those pages
are in the <a href="http://twitter.github.io/bootstrap/examples/starter-template.html">starter-template.html</a> template.
</p>

<ol class="org-ol">
<li><code>[&#xa0;]</code> Initialize a new Rails application
<div class="org-src-container">

<pre class="src src-sh">rails new bootstrap
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Change into the newly created Rails application directory
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">cd</span> bootstrap
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Clone <a href="https://github.com/troywill/twitter-bootstrap-for-beginners">this tutorial</a> from Github.
<div class="org-src-container">

<pre class="src src-sh">git clone https://github.com/troywill/twitter-bootstrap-for-beginners.git
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Examine your Rails installation
<div class="org-src-container">

<pre class="src src-sh">rake about
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Enable a JavaScript runtime in <a href="../Gemfile">Gemfile</a>

<p>
You probably got a 'Could not find a JavaScript runtime.' message from the
'rake about' command. Open <a href="../Gemfile">Gemfile</a> with your text editor and enable 'therubyracer.'
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b22222;"># </span><span style="color: #b22222;">See https://github.com/sstephenson/execjs#readme for more supported runtimes</span>
gem <span style="color: #8b2252;">'therubyracer'</span>, <span style="color: #008b8b;">platforms</span>: <span style="color: #008b8b;">:ruby</span>
</pre>
</div>

<p>
You might open <a href="../Gemfile">Gemfile</a> with Emacs, Vi, <a href="http://macromates.com/">TextMate</a>, etc. this way:
</p>
<pre class="example">
textmate ../../Gemfile
</pre>
</li>
<li><code>[&#xa0;]</code> Examine your Rails installation again
<div class="org-src-container">

<pre class="src src-sh">rake about
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Create a “home” controller and “home/index”, "home/about", "home/contact" pages
<div class="org-src-container">

<pre class="src src-sh">rails generate controller home index about contact --skip-stylesheets
</pre>
</div>

<p>
Note the use of '&#x2013;skip-stylesheets' since we will use Twitter Bootstrap's stylesheets
</p>
</li>
<li><code>[&#xa0;]</code> Set the default route to home/index in <a href="../config/routes.rb">config/routes.rb</a>

<p>
Open <a href="../config/routes.rb">config/routes.rb</a>  with your text editor. You will see the following
two commented lines near the top of the file:
</p>
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #b22222;"># </span><span style="color: #b22222;">You can have the root of your site routed with "root"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">root 'welcome#index'</span>
</pre>
</div>
<p>
Let's uncomment and change the root:
</p>

<div class="org-src-container">

<pre class="src src-ruby">root <span style="color: #8b2252;">'home#index'</span>
</pre>
</div>

<p>
Now, Rails will direct vistors to the application to home/index. We are
ready to start the Rails application and incorporate Twitter Bootstrap's
stylesheets and JavaScript scripts.
</p>
</li>
<li><code>[&#xa0;]</code> Start the rails server
<div class="org-src-container">

<pre class="src src-sh">rails server --port 3000
</pre>
</div>
</li>
</ol>

<p>
Now, let's incorporate Bootstrap into our application.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <code>[0/4]</code> Incorporate <a href="http://twitter.github.io/bootstrap/">Twitter Bootstrap</a>'s CSS style sheets and JavaScript scripts.</h2>
<div class="outline-text-2" id="text-3">
<p>
The heart of Twitter Bootstrap is two files: <a href="https://github.com/twitter/bootstrap/blob/master/docs/assets/css/bootstrap.css">bootstrap.css</a> and <a href="https://github.com/twitter/bootstrap/blob/master/docs/assets/js/bootstrap.js">bootstrap.js</a>. We copy
the minified forms of those files ( bootstrap.min.css and bootstrap.min.js ) to our
Rails application structure and Rails will detect and incorporate them into the application.
</p>

<ol class="org-ol">
<li><code>[&#xa0;]</code> Download the Zipfile from Twitter Bootstrap website from your web browser or web client.
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">./bin/fetch-bootstrap-zip.sh</span>
wget http://twitter.github.io/bootstrap/assets/bootstrap.zip
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Decompress the bootstrap.zip Zip file
<div class="org-src-container">

<pre class="src src-sh">unzip bootstrap.zip
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Copy the Bootstrap CSS and Javascript files to our Rails application structure
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">./bin/copy-bootstrap-to-rails.sh</span>
cp -iv bootstrap/css/bootstrap.min.css ../app/assets/stylesheets
cp -iv bootstrap/css/bootstrap-responsive.css ../app/assets/stylesheets
cp -iv bootstrap/js/bootstrap.min.js ../app/assets/javascripts
</pre>
</div>
</li>
<li><code>[&#xa0;]</code> Copy glyphicons-halflings.png and glyphicons-halflings-white.png
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">./bin/copy-bootstrap-to-rails.sh</span>
mkdir -v ../app/assets/images
cp -iv bootstrap/img/glyphicons-halflings.png ../app/assets/images/
cp -iv bootstrap/img/glyphicons-halflings-white.png ../app/assets/images/
</pre>
</div>
</li>
</ol>

<p>
Now that we have <a href="https://github.com/twitter/bootstrap/blob/master/docs/assets/css/bootstrap.css">bootstrap.css</a> and <a href="https://github.com/twitter/bootstrap/blob/master/docs/assets/js/bootstrap.js">bootstrap.js</a> incorporated into our Rails
application we can proceed to change the default Rails application layout
to use Bootstrap's CSS and Javascript.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <code>[0/2]</code> Use Twitter Bootstrap fixed width layout in our Rails application</h2>
<div class="outline-text-2" id="text-4">
<p>
Now that Bootstrap is installed let's proceed to use Bootstrap's CSS in our application.
</p>

<ol class="org-ol">
<li><code>[&#xa0;]</code> Overwrite app/views/layouts/application.html.erb with <a href="app/views/layouts/starter-template.html.erb">starter-template.html.erb</a> 

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">./bin/copy-starter-template.sh</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">this command will replace the default rails layout with a Twitter Bootstrap layout</span>
cp -v app/views/layouts/starter-template.html.erb ../app/views/layouts/application.html.erb
</pre>
</div>

<p>
<a href="app/views/layouts/starter-template.html.erb">starter-template.html.erb</a> is Twitter Bootstrap's <a href="https://github.com/twitter/bootstrap/blob/master/docs/examples/starter-template.html">starter template</a> example merged
with the default <a href="app/views/layouts/application.html.erb">app/views/layouts/application.html.erb</a> file that Rails generates.
</p>

<p>
Here's the resulting app/views/layouts/application.html.erb:
</p>
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000ff;">html</span>&gt;
&lt;<span style="color: #0000ff;">head</span>&gt;
  &lt;<span style="color: #0000ff;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Bootstrap</span>&lt;/<span style="color: #0000ff;">title</span>&gt;
  &lt;%= stylesheet_link_tag    <span style="color: #8b2252;">"application"</span>, media: <span style="color: #8b2252;">"all"</span>, <span style="color: #8b2252;">"data-turbolinks-track"</span> =&gt; true %&gt;
  &lt;%= javascript_include_tag <span style="color: #8b2252;">"application"</span>, <span style="color: #8b2252;">"data-turbolinks-track"</span> =&gt; true %&gt;
  &lt;%= csrf_meta_tags %&gt;
  &lt;<span style="color: #0000ff;">style</span>&gt;
    body {
    padding-top: 60px; /* 60px to make the container go all the way to the bottom of the topbar */
    }
  &lt;/<span style="color: #0000ff;">style</span>&gt;  
&lt;/<span style="color: #0000ff;">head</span>&gt;

    &lt;<span style="color: #0000ff;">body</span>&gt;

      &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"navbar navbar-inverse navbar-fixed-top"</span>&gt;
        &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"navbar-inner"</span>&gt;
          &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"container"</span>&gt;
            &lt;<span style="color: #0000ff;">button</span> <span style="color: #a0522d;">type</span>=<span style="color: #8b2252;">"button"</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"btn btn-navbar"</span> <span style="color: #a0522d;">data-toggle</span>=<span style="color: #8b2252;">"collapse"</span> <span style="color: #a0522d;">data-target</span>=<span style="color: #8b2252;">".nav-collapse"</span>&gt;
              &lt;<span style="color: #0000ff;">span</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"icon-bar"</span>&gt;&lt;/<span style="color: #0000ff;">span</span>&gt;
              &lt;<span style="color: #0000ff;">span</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"icon-bar"</span>&gt;&lt;/<span style="color: #0000ff;">span</span>&gt;
              &lt;<span style="color: #0000ff;">span</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"icon-bar"</span>&gt;&lt;/<span style="color: #0000ff;">span</span>&gt;
            &lt;/<span style="color: #0000ff;">button</span>&gt;
            &lt;<span style="color: #0000ff;">a</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"brand"</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"#"</span>&gt;Project name&lt;/<span style="color: #0000ff;">a</span>&gt;
            &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"nav-collapse collapse"</span>&gt;
              &lt;<span style="color: #0000ff;">ul</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"nav"</span>&gt;
                &lt;<span style="color: #0000ff;">li</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"active"</span>&gt;&lt;<span style="color: #0000ff;">a</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"#"</span>&gt;Home&lt;/<span style="color: #0000ff;">a</span>&gt;&lt;/<span style="color: #0000ff;">li</span>&gt;
                &lt;<span style="color: #0000ff;">li</span>&gt;&lt;<span style="color: #0000ff;">a</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"#about"</span>&gt;About&lt;/<span style="color: #0000ff;">a</span>&gt;&lt;/<span style="color: #0000ff;">li</span>&gt;
                &lt;<span style="color: #0000ff;">li</span>&gt;&lt;<span style="color: #0000ff;">a</span> <span style="color: #a0522d;">href</span>=<span style="color: #8b2252;">"#contact"</span>&gt;Contact&lt;/<span style="color: #0000ff;">a</span>&gt;&lt;/<span style="color: #0000ff;">li</span>&gt;
              &lt;/<span style="color: #0000ff;">ul</span>&gt;
            &lt;/<span style="color: #0000ff;">div</span>&gt;<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">/.nav-collapse </span><span style="color: #b22222;">--&gt;</span>
          &lt;/<span style="color: #0000ff;">div</span>&gt;
        &lt;/<span style="color: #0000ff;">div</span>&gt;
      &lt;/<span style="color: #0000ff;">div</span>&gt;
      &lt;<span style="color: #0000ff;">div</span> <span style="color: #a0522d;">class</span>=<span style="color: #8b2252;">"container"</span>&gt;

        &lt;<span style="color: #0000ff;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Bootstrap starter template</span>&lt;/<span style="color: #0000ff;">h1</span>&gt;
        &lt;<span style="color: #0000ff;">p</span>&gt;Use this document as a way to quick start any new project.&lt;<span style="color: #0000ff;">br</span>&gt; All you get is this message and a barebones HTML document.&lt;/<span style="color: #0000ff;">p</span>&gt;
        &lt;%= yield %&gt;

      &lt;/<span style="color: #0000ff;">div</span>&gt; <span style="color: #b22222;">&lt;!-- </span><span style="color: #b22222;">/container </span><span style="color: #b22222;">--&gt;</span>

    &lt;/<span style="color: #0000ff;">body</span>&gt;


&lt;/<span style="color: #0000ff;">body</span>&gt;
&lt;/<span style="color: #0000ff;">html</span>&gt;
</pre>
</div>

<p>
The starter example layout uses a fixed width layout, which is introduced at <a href="http://twitter.github.io/bootstrap/scaffolding.html#layouts">scaffolding.html#layouts</a>.
</p>
</li>
<li><code>[&#xa0;]</code> Compare our application at <a href="http://localhost:3000">http://localhost:3000</a> with <a href="http://twitter.github.io/bootstrap/examples/starter-template.html">http://twitter.github.io/bootstrap/examples/starter-template.html</a>.

<p>
Our newly created Rails application running on port 3000 should have essentially the
same appearance as the example running on Twitter's github.io site. It it doesn't something
went wrong.
</p>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2013-05-13 Mon 17:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
